{"@context":"http:\/\/schema.org","@type":"Recipe","name":"Balsamic Pork Loin Roast (Instant Pot)","author":{"@type":"Person","name":"Sandy Clifton"},"description":"Instant Pot Balsamic Pork Loin Roast has a deep, rich and tangy flavor. The balsamic reduction sauce over the pork roast is amazing!","datePublished":"2019-07-03T09:34:34+00:00","image":"https:\/\/www.simplyhappyfoodie.com\/wp-content\/uploads\/2019\/07\/instant-pot-pork-loin-3-480x270.jpg","recipeYield":1,"prepTime":"PT0H17M","cookTime":"PT0H35M","totalTime":"PT1H12M","recipeIngredient":["2 lb Pork Loin Roast* ((not tenderloin) boneless)","2 tsp Kosher Salt, (divided)","1 tsp Pepper, (divided)","1 Tbsp Olive Oil","1 Onion, (sliced into thick rounds)","1 tsp Garlic Powder","1\/3 cup Apple Cider","1\/3 cup Balsamic Vinegar ((good quality))","1 Apple, (sliced thick (core it, but no need to peel))","3 Tbsp Corn Starch","3 Tbsp Cold Water","2 Tbsp Honey"],"recipeInstructions":["Salt and pepper all sides of the roast, using 1 tsp of the salt and 1\/2 tsp of the pepper. Set aside.","Turn on the Sauté setting. When hot, add the oil.","Add the pork roast and and onion. Brown the roast for 2-3 minutes per side. Then remove it to a plate.","Sprinkle the garlic powder, and remaining salt and pepper over the onions.","Add the apple cider, and when it starts to simmer, stir, scraping the bottom of the pot to get up all of the browned bits (deglaze).","Pour in the balsamic vinegar.","Add the apple slices to the pot and then set the roast on top.","Cancel the sauté setting.","Close the lid and set the steam release knob to the Sealing position.","Press the Pressure Cook\/Manual button or dial, then the +\/- button or dial to select 30 minutes. High Pressure. (if your roast is larger than 2.5 pounds, or is bone-in, add 10 minutes cook time per pound.). The pot will take several minutes to come to pressure.","When the cook cycle has finished, turn off the pot and let it sit undisturbed for 12 minutes (12 minute natural release). Then turn the steam release knob to the Venting position to release the remaining steam\/pressure.","When the pin in the lid drops back down, open the lid.","Take the temperature of the roast. It should be close to 145° F. If it is much below that (by 10 degrees or more), place the lid back on the pot and seal it. Then set time for \"0\" minutes and after it is done, let it sit 5 minutes before releasing pressure and opening it.","Remove the roast to a plate and loosely cover with foil.","Whisk together the corn starch and the cold water. Set aside.","Turn the sauté setting on and when it starts to simmer, stir in the corn starch slurry. Keep stirring until the sauce thickens.","Turn off the pot and stir in the honey. Taste the sauce and adjust seasonings if desired. You can add more honey if you like it sweeter.","Transfer roast to a serving dish, slice it, and pour some of the sauce over it.","Serve each portion with some of the extra sauce."],"aggregateRating":{"@type":"AggregateRating","ratingValue":"4.93","ratingCount":"13"},"recipeCategory":"Instant Pot","recipeCuisine":["American"],"keywords":"pressure cooker apple cider pork roast","nutrition":{"@type":"NutritionInformation","calories":"463 kcal","servingSize":"1 serving"},"@id":"https:\/\/www.simplyhappyfoodie.com\/instant-pot-balsamic-pork-loin\/#recipe","isPartOf":{"@id":"https:\/\/www.simplyhappyfoodie.com\/instant-pot-balsamic-pork-loin\/#article"},"mainEntityOfPage":"https:\/\/www.simplyhappyfoodie.com\/instant-pot-balsamic-pork-loin\/#webpage","url":"https:\/\/www.simplyhappyfoodie.com\/instant-pot-balsamic-pork-loin\/#wprm-recipe-container-9081","id":264,"dateCreated":"0","dateModified":"2021-02-03T01:30:03+0000","printImage":false,"imageUrl":"\/apps\/cookbook\/recipes\/264\/image?size=full","tool":[]}