{"@context":"http:\/\/schema.org","@type":"Recipe","name":"Gâteau Invisible (Invisible Apple Cake)","datePublished":"2020-11-18T13:00:01","dateModified":"1607562728","description":"This French dessert gets its name from the way its layers of thinly sliced apple seem to disappear into the light batter that binds them. In a nod to the popularity of gateau invisible in Japan, this version is subtly flavored with salty-sweet white miso, and served with a miso caramel sauce.\n\nWhite (shiro) miso works best with this recipe; darker misos such as red miso, awase miso, or barley miso will yield a more savory cake, and could yield a darker caramel sauce.\n\nI tested this recipe with Fuji apples, Pink Lady apples, Lady Alice apples, Granny Smith apples, and Golden Delicious apples; I prefer Fuji, Pink Lady, or Lady Alice, but different apples may produce slightly different textures and flavors. When assembling the cake, you can quickly pour in all of the apples and batter, but the resulting cake will not be as uniform in appearance. Because of variation in the shape of the apples, the amount of apples that will fit into the pan may vary. When purchasing apples, buy a few extra in order to fill the pan if necessary. You can slice the apples from anywhere between 1\/16 of an inch up to 1\/8 of an inch; the thinner you slice the apples, the more layers you will get in the cake and the more cohesive the baked cake will be, though you have to weigh that against the more tedious layering process of thinner slices.","image":"https:\/\/www.seriouseats.com\/2020\/11\/20201115-gateau-invisible-apple-cake-tim-chin-hero-1.jpg","aggregateRating":{"@type":"AggregateRating","ratingValue":"4.3076923076923","ratingCount":"13"},"recipeCuisine":"French","recipeCategory":"Dessert","recipeYield":1,"totalTime":"PT4H30M","recipeIngredient":["For the Cake:","Vegetable oil or cooking spray, for greasing the pan","1 cup all-purpose flour (5 ounces), plus more for dusting the pan","1 teaspoon (5g) baking powder","3 tablespoons (54g) white miso (see note)","2 tablespoons unsalted butter, melted","1\/2 cup whole milk (120ml)","3 large eggs","2\/3 cup (4 3\/4 ounces; 133g) sugar ","2 1\/2 pounds (1.1kg) apples, such as Fuji or Pink Lady, peeled, cored, and cut into 1\/16- to 1\/8-inch thick slices (see note) ","For the Caramel Sauce:","1\/4 cup (60ml) water","1\/2 cup plus 2 tablespoons (4 1\/4 ounces; 120g) sugar","3\/4 cup (180ml) heavy cream","2 tablespoons (36g) white miso"],"recipeInstructions":["For the Cake: Grease an 8 1\/2- by 4 1\/2-inch loaf pan and line with a 8- by 13-inch sheet of parchment paper so that parchment hangs over the long sides of the pan, forming a sling. ","Grease exposed sides of parchment paper, then dust with flour, making sure to lightly coat bottom and sides; carefully tap out excess flour. Adjust oven rack to middle position and preheat to 375°F (190°C).","In a small bowl, whisk flour and baking powder until well combined, at least 30 seconds; set bowl aside.","In a medium bowl, whisk miso and butter until miso is broken up. Whisk in roughly 2 tablespoons of milk until mixture is smooth and no lumps remain, about 30 seconds. Whisk in remaining milk until smooth; set aside.","In the bowl of a stand mixer fitted with a whisk attachment, whisk eggs and sugar at medium speed until pale and glossy, 60 to 90 seconds. (Alternatively, beat eggs and sugar in a large mixing bowl using an electric handheld mixer or a whisk, about 90 seconds for the electric mixer and 2 minutes for the whisk.)","Whisk in half of flour mixture until just combined. Whisk in milk mixture, followed by remaining flour mixture, until no lumps remain.","Using a large rubber spatula or wooden spoon, stir apples into batter until evenly coated. ","Using clean hands, arrange apple slices in prepared loaf pan in an overlapping pattern, making sure that flat sides of the apples are flush with the edges of pan (as you work, reserve some of the largest, nicest apple slices for the top layer; you'll need roughly 40 to 50 slices for it). Continue arranging apples in even layers until apples are 1\/2 inch from top; press apples down to evenly distribute.","Arrange final layer of apples in horizontal, shingled pattern. ","Scrape remaining batter into pan, making sure to leave 1\/4 inch space from top; gently tap pan to knock out air pockets and distribute batter.","Set loaf pan on middle rack of oven and slide a rimmed baking sheet on the rack underneath to catch any drips. Bake until top is golden brown and domed and a cake tested inserted into the center meets little resistance and comes out clean, 65 to 75 minutes; rotate pan one time halfway through baking. Transfer cake to wire rack and cool for 10 minutes; loosen sides with butter knife or offset spatula. Cool cake in pan to about 140°F (60°C), about 2 hours. Then lift loaf using overhanging parchment and transfer to a cutting board. Let cake cool completely before slicing, about 1 hour longer.","Meanwhile, for the Caramel: In a 3-quart stainless steel saucier, combine water and sugar over medium heat. Stir with a fork until syrup comes to a boil, about 4 minutes, then simmer without stirring until syrup is honey-colored, roughly 5 minutes, shaking and swirling as needed to ensure even caramelization. Continue cooking until syrup is light to medium amber, about 1 minute longer.","Immediately add cream and reduce heat to medium-low.","Stirring constantly with a heat-resistant spatula to knock back the foam, simmer until caramel registers 225°F (107°C) on a digital thermometer, about 3 minutes.","Off heat, whisk in miso until smooth and combined. Transfer sauce to a heat-safe container.","To serve, using a serrated knife, cut cake into 1-inch thick slices and serve with warm or room temperature caramel.","The cake can be stored, covered, at room temperature for up to 1 day. The caramel can be refrigerated in an airtight container for up to 7 days; gently rewarm to a pourable consistency before using."],"author":{"@type":"Person","name":"Tim Chin","jobTitle":"Contributor","description":"Tim Chin is a professional cook and sometimes writer. He cooked for years at restaurants in New York and Boston, working at Rouge Tomate, Northern Spy, and most recently, BiSq. He also spent three years at America’s Test Kitchen, creating and testing recipes. He is passionate about sourdough, funky hot sauce, and sustainable agriculture. Outside of cooking, Tim spends most of his free time rock climbing and trying not to kill his house plants.","url":"https:\/\/www.seriouseats.com\/user\/profile\/tim-chin"},"keywords":"","tool":[" 8 1\/2- by 4 1\/2-inch loaf pan"],"url":"https:\/\/www.seriouseats.com\/recipes\/2020\/11\/gateau-invisible.html","id":"1547","dateCreated":"0","printImage":"false","imageUrl":"\/apps\/cookbook\/recipes\/1547\/image?size=full"}